Revit 2027 API
Family.IsInPlace Property
 True if the family is an in-place family, false if the family is a loadable family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInPlace { get; }
Public ReadOnly Property IsInPlace As Boolean
	Get
public:
property bool IsInPlace {
	bool get ();
}
member IsInPlace : bool with get
Property Value
Boolean
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace